Repository: jors/naufrago
Catalog: naufrago/naufrago-rss-reader-deb/debian/usr/share/naufrago/locale/*/*.po
Languages: it

source: Error importing modules:
it: Errore durante límportazione dei moduli

source: Unread
it: Non letto

source: Important
it: Importante

source: Special folder
it: Cartella speciale

source: Source
it: Sorgenti

source: Category
it: Categoria

source: Warning!
it: Avviso!

source: Upgrade checker
it: Controllo d'aggiornamenti

source: Close
it: Chiudi

source: No updates available.
it: Nessun aggiornamento disponibile

source: Coult not contact server. Try again later!
it: Non si può contattare il server. Riprovi più tardi

source: Naufrago! is a simple RSS reader
it: Naufrago! è un semplice lettore RSS

source: _Archive
it: _Archivio

source: _New feed
it: _Nuovo feed

source: Adds a feed
it: Aggiungi un feed

source: New _category
it: Nuova _categoria

source: Adds a category
it: Aggiungi una categoria

source: Delete feed
it: Cancellare feed

source: Deletes a feed
it: Cancella un feed

source: Delete category
it: Cancellare categoria

source: Deletes a category
it: Cancella una categoria

source: Import feeds
it: Importare i feeds

source: Imports a feedlist
it: Importa un feedlist

source: Export feeds
it: Esportare feeds

source: Exports a feedlist
it: Esporta un feddlist

source: _Quit
it: Esci

source: Quits
it: Esce dell'applicazione

source: E_dit
it: Mo_dificare

source: _Edit
it: Modifica

source: Edits the selected element
it: Modifica la voce selezionata

source: Search
it: Cerca

source: Searchs for a term in the feeds
it: Cerca una parola nei feed

source: _Preferences
it: _Preferenze

source: Shows preferences
it: Mostra le preferenze

source: _Network
it: Rete

source: _Update
it: Aggiornare

source: Updates the selected feed
it: Aggiorna elfeed selezionato

source: Update all
it: Aggiornare tutto

source: Update all feeds
it: Aggiorna tutti i feeds

source: Stop update
it: Interrompere l'aggiornamento

source: _Help
it: Aiuto

source: Check updates
it: Controllo d'aggiornamenti

source: _About
it: _Intorno a

source: About
it: Intorno a

source: Date
it: Data

source: Title
it: Titolo

source: Clic to fullscreen
it: Fare clic per schermo pieno

source: Clic to open in browser
it: Fare clic per aprire nel browser

source: Quit
it: Uscire

source: Today
it: Oggi

source: Edit category
it: Modificare categoria

source: Change <b>category</b> name to:
it: Cambiare il nome della <b>categoria</b> a:

source: Edit
it: Modifica

source: Add category
it: Aggiungere categoria

source: Please, insert the <b>category</b>:
it: Per favore, inserire la <b>categoria</b>:

source: Create
it: Creare

source: Category <b>already present</b>!
it: Categoria <b>già presente</b>!

source: Delete the selected <b>category</b>?
it: Cancellare la <b>categoria</b> selezionata?

source: <b>Atention:</b> all contained RSS will be also deleted. Proceed?
it: <b>Attenzione:</b> tutti i feed contenuti saranno anche eliminati. Procedere?

source: This category <b>cannot be deleted</b>!
it: Questa categoria <b>non può essere cancellata</b>!

source: You <b>must choose a category</b> folder!
it: È necessario <b>scegliere una cartella di categoria</b>!

source: Name
it: Nome

source: Edit feed
it: Modificare feed

source: Change <b>feed</b> data:
it: Modificare dati del <b>feed</b>:

source: Add feed
it: Aggiungere feed

source: Please, insert <b>feed</b> address:
it: Per favore, inserire lo indirizzo del <b>feed</b>:

source: Add
it: Aggiungere

source: Default name
it: Nome di default

source: Feed <b>already present</b>!
it: Feed già presente

source: Delete selected <b>feed</b>?
it: Eliminare il <b>feed</b> selezionato?

source: You <b>must choose a feed</b>!
it: Devi <b>scegliere un feed</b>!

source: This category <b>cannot be edited</b>!
it: Questa categoria <b>non può essere modificata</b>!

source: You <b>must choose a category or a feed</b> to edit!
it: Devi <b>scegliere una categoria o un feed</b> per modificare!

source: Insert the <b>searchterm</b>:
it: Inserire la <b>ricerca sterna</b>:

source: Search results for
it: Risultati della ricerca per

source: No entry found for <b>
it: Nessun risultato trovato per <b>

source: Preferences
it: Preferenze

source: Save
it: Salvare

source: Start with unfolded tree
it: Avviare con albero spiegato

source: Driven mode
it: Modo guidato

source: Start in Tray Icon
it: Avvio in Tray Icon

source: Update on start
it: Aggiornamento all'avvio

source: Check application updates on start
it: Controlla aggiornamenti delle applicazioni all'avvio

source: Start
it: Avvio

source: Number of feed entries
it: Numero dei commenti

source: Update every
it: Aggiornamento ogni

source: hour/s
it: ora/e

source: minute/s
it: minuto/i

source: Hide read entries
it: Nascondi le nuove voci

source: Feeds & articles
it: Feed e articoli

source: Hide dates
it: Nascondi le date

source: Notification on new entries
it: Notifica di nuove voci

source: Show icon in tray
it: Mostra icona nel tray

source: Toolbar mode
it: Toolbar modalità

source: Full
it: Completo

source: Icons only
it: Solo le icone

source: Text only
it: Solo testo

source: Hidden
it: Nascosto

source: Interface
it: Interfaccia

source: Offline mode (slower!)
it: Modo offline (più lento!)

source: Modes
it: Modi

source: Mark all as read
it: Segna tutto como letto

source: Update
it: Aggiorna

source: Delete
it: Cancella

source: New feed
it: Nuovo feed

source: New category
it: Nuova categoria

source: Open in browser
it: Aprire nel browser

source: Copy URL to clipboard
it: Copia URL nello clipboard

source: Toggle read/non-read
it: Toggle letto/non-letto

source: Toggle all read/non-read
it: Toggle tutti letto/non-letto

source: Without title
it: Senza titolo

source: Without link
it: Senza link

source: Obtaining image
it: Ottenendo immagine

source: Obtaining feed
it: Ottenendo feed

source: Open..
it: Aprire..

source: All files
it: Tutti i file

source: _Save
it: _Salvare
