Repository: jors/naufrago
Catalog: naufrago/*.po
Languages: ca

source: Unread
ca: No llegits

source: Important
ca: Importants

source: Special folder
ca: Carpeta especial

source: Source
ca: Font

source: Category
ca: Categoria

source: Warning!
ca: Atenció!

source: Naufrago! is a simple RSS reader
ca: Naufrago! es un lector simple de RSS

source: _Archive
ca: _Arxiu

source: _New feed
ca: _Nova font

source: Adds a feed
ca: Afegeix una font

source: New _category
ca: Nova _categoria

source: Adds a category
ca: Afegeix una categoria

source: Delete feed
ca: Esborrar font

source: Deletes a feed
ca: Esborra una font

source: Delete category
ca: Esborra categoria

source: Deletes a category
ca: Esborra una categoria

source: Import feeds
ca: Importar fonts

source: Imports a feedlist
ca: Importa una llista de fonts

source: Export feeds
ca: Exportar fonts

source: Exports a feedlist
ca: Exporta la llista de fonts

source: _Quit
ca: Sortir

source: Quits
ca: Surt de l'aplicació

source: E_dit
ca: E_ditar

source: _Edit
ca: _Edita

source: Edits the selected element
ca: Edita l'element seleccionat

source: Search
ca: Buscar

source: Searchs for a term in the feeds
ca: Busca per a un terme a les fonts

source: _Preferences
ca: _Preferències

source: Shows preferences
ca: Mostra les preferències

source: _Network
ca: Xarxa

source: _Update
ca: Actualitzar

source: Updates the selected feed
ca: Actualitza la font seleccionada

source: Update all
ca: Actualitzar tot

source: Update all feeds
ca: Actualitzar totes les fonts

source: _Help
ca: Ajuda

source: FAQ
ca: PUF

source: _About
ca: Sobre

source: About
ca: Sobre

source: Feeds
ca: Fonts

source: Date
ca: Data

source: Title
ca: Títol

source: Clic to fullscreen
ca: Fes clic per a pantalla completa

source: Clic to open in browser
ca: Fes clic per a obrir en un navegador

source: Quit
ca: Sortir

source: Today
ca: Avui

source: Edit category
ca: Editar categoria

source: Change <b>category</b> name to:
ca: Canviar el nom de la <b>categoria</b> a:

source: Edit
ca: Editar

source: Add category
ca: Afegir categoria

source: Please, insert the <b>category</b>:
ca: Si us plau, introdueix la <b>categoria</b>:

source: Create
ca: Crear

source: Delete the selected <b>category</b>?
ca: Esborrar la <b>categoria</b> seleccionada?

source: <b>Atention:</b> all contained RSS will be also deleted. Proceed?
ca: Atenció: tots els RSS que conté s'esborrarán. Prodecir?

source: This category <b>cannot be deleted</b>!
ca: La categoria General <b>no pot ser esborrada</b>!

source: You <b>must choose a category</b> folder!
ca: Tens que <b>escollir una categoria</b>!

source: Name
ca: Nom

source: Edit feed
ca: Editar font

source: Change <b>feed</b> data:
ca: Canviar les dades de la <b>font</b>:

source: Add feed
ca: Afegir font

source: Please, insert <b>feed</b> address:
ca: Si us plau, introdueix la direcció de la <b>font</b>:

source: Add
ca: Afegir

source: Default name
ca: Nom per defecte

source: Delete selected <b>feed</b>?
ca: Esborrar la <b>font</b> seleccionada?

source: You <b>must choose a feed</b>!
ca: Tens que <b>escollir una font</b>!

source: This category <b>cannot be edited</b>!
ca: La categoria General <b>no pot ser editada</b>!

source: You <b>must choose a category or a feed</b> to edit!
ca: Tens que <b>escollir una categoria o una font</b> per a editar!

source: Insert the <b>searchterm</b>:
ca: Introdueix el <b>terme de búsqueda</b>:

source: Search results for
ca: Resultats per a

source: No entry found for <b>
ca: No s'han trobat entrades per a <b>

source: Preferences
ca: Preferències

source: Save
ca: Desar

source: Start with unfolded tree
ca: Iniciar amb arbre desplegat

source: Start in Tray Icon
ca: Iniciar con a Tray Icon

source: Update on start
ca: Actualitzar a l'inici

source: Start
ca: Inici

source: Number of feed entries
ca: Nombre d'entrades per font

source: Update every (hours)
ca: Actualitzar font cada (hores)

source: Offline mode (slower!)
ca: Mode offline (més lent!)

source: Hide read entries
ca: Amagar entrades llegides

source: Feeds & articles
ca: Fonts i articles

source: Show notification on new entries
ca: Mostrar notificació per a noves entrades

source: Show icon in tray
ca: Mostrar icona a la tray

source: Toolbar mode
ca: Mode toolbar

source: Full
ca: Complerta

source: Icons only
ca: Nomès icones

source: Text only
ca: Nomès text

source: Hidden
ca: Amagada

source: Interface
ca: Interfície

source: Mark all as read
ca: Marcar tot com llegit

source: Update
ca: Actualitzar

source: Delete
ca: Esborrar

source: New feed
ca: Nova font

source: New category
ca: Nova categoria

source: Open in browser
ca: Obrir en navegador

source: Copy URL to clipboard
ca: Copiar URL al portapapers

source: Toggle read/non-read
ca: Alternar entre llegit/no-llegit

source: Toggle all read/non-read
ca: Alternar tot entre llegit/no-llegit

source: Without title
ca: Sense títol

source: Without link
ca: Sense enllaç

source: Obtaining image
ca: Obtenint imatge

source: Obtaining feed
ca: Obtenint font

source: Open..
ca: Obrir..

source: All files
ca: Tots els arxius

source: _Save
ca: Desar
