Repository: jors/naufrago
Catalog: naufrago/naufrago-rss-reader-tar/locale/*/*.po
Languages: es

source: Source
es: Fuente

source: Category
es: Categoría

source: Naufrago! is a simple RSS reader
es: Naufrago! es un lector simple de RSS

source: _Archive
es: _Archivo

source: New _feed
es: Nuevo _feed

source: Adds a feed
es: Añade un feed

source: New _category
es: Nueva _categoría

source: Adds a category
es: Añade una categoría

source: Delete _feed
es: Borrar _categoría

source: Deletes a feed
es: Borra un feed

source: Delete _category
es: Borrar _categoría

source: Deletes a category
es: Borra una categoría

source: Import feeds
es: Importar feeds

source: Imports a feedlist
es: Importa una lista de feeds

source: Export feeds
es: Exportar feeds

source: Exports a feedlist
es: Exporta la lista de feeds

source: _Quit
es: Salir

source: Quits
es: Sale de la aplicación

source: E_dit
es: E_ditar

source: _Edit
es: _Edita

source: Edits the selected element
es: Edita el elemento seleccionado

source: _Preferences
es: _Preferencias

source: Shows preferences
es: Muestra las preferencias

source: _Network
es: Red

source: _Update
es: Actualizar

source: Updates the selected feed
es: Actualiza el feed seleccionado

source: U_pdate all
es: Actualizar todo

source: Update all feeds
es: Actualiza todos los feeds

source: _Help
es: Ayuda

source: FAQ
es: PUF

source: _About
es: _Acerca de

source: About
es: Acerca de

source: Date
es: Fecha

source: Title
es: Título

source: Clic to fullscreen
es: Haz clic para pantalla completa

source: Clic to open in browser
es: Haz clic para abrir en un navegador

source: Update all
es: Actualizar todo

source: Quit
es: Salir

source: Today
es: Hoy

source: Edit category
es: Editar categoría

source: Change <b>category</b> name to:
es: Cambiar el nombre de la <b>categoría</b> a:

source: Add category
es: Añadir categoría

source: Please, insert the <b>category</b>:
es: Por favor, inserta la <b>categoría</b>:

source: Delete category
es: Borrar categoría

source: Delete the selected <b>category</b>?
es: ¿Borrar la <b>categoría</b> seleccionada?

source: <b>Atention:</b> all contained RSS will be also deleted. Proceed?
es: <b>Atención:</b> todos los feeds contenidos también se borrarán. ¿Proceder?

source: The General category cannot be deleted!
es: ¡La categoría General no puede ser borrada!

source: You must choose a category folder!
es: ¡Debes elegir una categoría!

source: Name
es: Nombre

source: Edit feed
es: Editar feed

source: Change <b>feed</b> data:
es: Cambiar datos del <b>feed</b>:

source: Add feed
es: Añadir feed

source: Please, insert <b>feed</b> data:
es: Por favor, inserta los datos del <b>feed</b>:

source: Default name
es: Nombre por defecto

source: Delete feed
es: Borrar feed

source: Delete selected <b>feed</b>?
es: ¿Borrar el <b>feed</b> seleccionado?

source: You must choose a feed!
es: ¡Debes elegir un feed!

source: You must choose a category or a feed to edit!
es: ¡Debes elegir una categoría o un feed a editar!

source: Preferences
es: Preferencias

source: Number of feed entries
es: Número de entradas

source: Update every (in hours)
es: Actualizar cada (en horas)

source: Offline mode (slower!)
es: Modo offline (¡más lento!)

source: Start
es: Inicio

source: Start with unfolded tree
es: Iniciar con árbol desplegado

source: Start in Tray Icon
es: Iniciar como Tray Icon

source: Update on start
es: Actualizar al inicio

source: Mark all as read
es: Marcar todo como leído

source: Update
es: Actualizar

source: Edit
es: Editar

source: Delete
es: Borrar

source: New feed
es: Nuevo feed

source: New category
es: Nueva categoría

source: Open in browser
es: Abrir en un navegador

source: Copy URL to clipboard
es: Copiar URL al portapapeles

source: Toggle read/non-read
es: Alternar leído/no-leído

source: Toggle all read/non-read
es: Alternar todos leído/no-leído

source: Without title
es: Sin título

source: Without link
es: Sin enlace

source: Obtaining image
es: Obteniendo imagen

source: Obtaining feed
es: Obteniendo feed

source: Open..
es: Abrir..

source: All files
es: Todos los ficheros
