<html>
 <head>
  <title>Preguntas de Uso Frecuente</title>
 </head>
 <body>
  <center><h1>Preguntas de Uso Frecuente</h1></center>
  <ol>
   <li><h2>Introducci&oacute;n</h2></li>
    <ul>
     <li><a href="#1">&iquest;Qu&eacute; &eacute;s N&aacute;ufrago!?</a></li>
     <li><a href="#2">&iquest;Qu&eacute; caracter&iacute;sticas tiene?</a></li>
     <li><a href="#3">&iquest;Cuales son los requisitos m&iacute;nimos?</a></li>
     <li><a href="#4">&iquest;Por qu&eacute; reinventar la rueda?</a></li>
     <li><a href="#5"><i>Homesite</i> o canales de distribuci&oacute;n</a></li>
    </ul>
   <li><h2>Funcionamiento</h2></li>
    <ul>
     <li><a href="#6">&iquest;C&oacute;mo funciona el <i>modo offline</i>?</a></li>
     <li><a href="#7">&iquest;C&oacute;mo funciona el <i>modo dirigido</i>?</a></li>
     <li><a href="#8">&iexcl;Quiero guardar los art&iacute;culos/entradas/posts importantes!</a></li>
     <li><a href="#9">No puedo crear subcategor&iacute;as</a></li>
     <li><a href="#10">No puedo borrar art&iacute;culos/entradas/posts de los feeds</a></li>
    </ul>
   <li><h2>Problemas</h2></li>
    <ul>
     <li><a href="#11">La cancelaci&oacute;n/parada de la actualizaci&oacute;n tarda</a></li>
     <li><a href="#12">La ordenaci&oacute;n por fecha de uno o varios feeds es incorrecta</a></li>
     <li><a href="#13">Las entradas de uno o varios feeds no muestran el contenido, s&oacute;lo los t&iacute;tulos (o ni eso)</a></li>
     <li><a href="#14">&iexcl;La aplicaci&oacute;n se cerr&oacute; inesperadamente!</a></li>
     <li><a href="#15">&iexcl;Quiero reportar/arreglar problemas!</a></li>
    </ul>
   <li><h2>Varios</h2></li>
    <ul>
     <li><a href="#16">Si las entradas RSS son res&uacute;menes, &iquest;son necesarias las im&aacute;genes offline?</a></li>
     <li><a href="#17">&iquest;Bajo qu&eacute; licencia se distribuye?</a></li>
     <li><a href="#18">Me gustar&iacute;a que la aplicaci&oacute;n hiciera/tuviera...</a></li>
     <li><a href="#19">Agradecimientos del autor</a></li>
     <li><a href="#20">&iquest;Te gusta N&aacute;ufrago!?</a></li>
    </ul>
  </ol>
  <hr>

  <h1>Introducci&oacute;n</h1>
  <h3 id="1"><u>&iquest;Qu&eacute; &eacute;s N&aacute;ufrago!?</u></h3>
  <p>N&aacute;ufrago! es un lector simple de RSS que permite ver noticias con sus im&aacute;genes <i>a&uacute;n sin mantenerse a flote</i>, o dicho de otro modo, sin estar online. Esto es porque hay gente, como el autor, que no siempre tiene una conexi&oacute;n a mano y, sin embargo, quiere poder leer art&iacute;culos/entradas/posts con las im&aacute;genes que puedan acompa&ntilde;arlos. Este es el <i>leit motiv</i> de la aplicaci&oacute;n.</p>
  <h3 id="2"><u>&iquest;Qu&eacute; caracter&iacute;sticas tiene?</u></h3>
  <p>Las destacadas ser&iacute;an:
  <ul>
   <li><b>Categorizaci&oacute;n</b> de feeds de un &uacute;nico nivel <b>en &aacute;rbol</b>.</li>
   <li>Organizaci&oacute;n de feeds por categor&iacute;as mediante <b>drag &amp; drop</b>.</li>
   <li><b>Lectura online/offline</b> de feeds (incluyendo im&aacute;genes).</li>
   <li><b>Apertura/cierre inteligente de categorias</b>.</li>
   <li>Modo <b>pantalla completa</b> para la lectura de feeds.</li>
   <li>Marcaci&oacute;n de <b>feeds</b> como <b>importantes</b>/<b>permanentes</b> (grabaci&oacute;n).</li>
   <li>Inclusi&oacute;n de los <b>favicons</b> de los feeds.</li>
   <li><b>Iconizaci&oacute;n</b> de la aplicaci&oacute;n <b>en la Tray</b>.</li>
   <li><b>Importaci&oacute;n/exportaci&oacute;n</b> de feeds en formato <b>OPML</b>.</li>
   <li>Carpetas de <b>importantes</b> y <b>no le&iacute;dos</b>.</li>
   <li><b>Buscador</b> de t&eacute;rminos.</li>
   <li><b>Multiidioma</b> (de momento Ingl&eacute;s, Polaco, Italiano, Catal&aacute;n y Castellano).</li>
   <li>Auto<b>comprobador de actualizaciones</b>.</li>
   </ul></p>
  <h3 id="3"><u>&iquest;Cuales son los requisitos m&iacute;nimos?</u></h3>
  <p>Si estas leyendo esto, probablemente ya los cumplas. A nivel de software:
  <ul>
   <li>Sistema Operativo GNU/Linux (dado que alguna libreria no est&aacute; para otras plataformas)</li>
   <li>Python</li>
   <li>python-gtk2 (bindings de gtk)</li>
   <li>python-gobject (bindings de GObject)</li>
   <li>python-pysqlite2 (bindings de sqlite3)</li>
   <li>python-feedparser (bindings de feedparser)</li>
   <li>python-webkit (bindings de webkit)</li>
  </ul>
  A nivel de hardware, cualquier cosa que pueda moverlo. El autor lo ha desarrollado y lo usa a diario desde un Netbook con un Intel Atom a 1,6Ghz con 1GB de RAM.</p>
  <h3 id="4"><u>&iquest;Por qu&eacute; reinventar la rueda?</u></h3>
  <p>Si es un cliente <i>clavado</i> (con excepciones) a Liferea (al menos en lo que al aspecto se refiere), &iquest;porqu&eacute; reinventar la rueda? Por muchos motivos. Principalmente porque el autor no supo encontrar un cliente RSS que funcionara offline con im&aacute;genes incluidas, los desarrolladores de Liferea no admiten <i>feature requests</i> (algo totalmente respetable) y mirar c&oacute;digo fuente ajeno requiere doble esfuerzo que crearlo uno mismo (ojo, &iexcl;opini&oacute;n personal!). Reinventando la rueda tambi&eacute;n se aprende, y adem&aacute;s pueden surgir mejoras o nuevas formas de hacer las cosas que de otro modo no hubieran aparecido.</p>
  <h3 id="5"><u><i>Homesite</i> o canales de distribuci&oacute;n</u></h3>
  <p>El proyecto puede encontrarse tanto en <a href="http://enchufado.com/">el blog del autor</a> como <a href="http://sourceforge.net/projects/naufrago">la p&aacute;gina del proyecto en sourceforge</a>.</p>
  <hr>

  <h1>Funcionamiento</h1>
  <h3 id="6"><u>&iquest;C&oacute;mo funciona el <i>modo offline</i>?</u></h3>
  <p>Este modo s&oacute;lo se asegura que se tenga acceso a los art&iacute;culos/entradas/posts con sus im&aacute;genes a&uacute;n sin conexi&oacute;n a Internet, sin interferir en otro aspecto en el funcionamiento de la aplicaci&oacute;n. Esto significa que puedes dejarlo activado siempre, tanto con conexi&oacute;n a Internet como sin, y la aplicaci&oacute;n seguir&aacute; obteniendo los art&iacute;culos/entradas/posts nuevos (caso de haber conexi&oacute;n). El &uacute;nico inconveniente es que consumir&aacute; m&aacute;s ancho de banda y tardar&aacute; m&aacute;s en obtener las actualizaciones, puesto que tambi&eacute;n bajar&aacute; las im&aacute;genes. <b>ATENCI&Oacute;N: </b>Para que el modo offline funcione correctamente, despu&eacute;s de activarlo en las preferencias, debes actualizar todos los feeds cuyas im&aacute;genes quieras poder ver sin conexi&oacute;n.</p>
  <h3 id="7"><u>&iquest;C&oacute;mo funciona el <i>modo dirigido</i>?</u></h3>
  <p>Este modo act&uacute;a desplegando/plegando las categor&iacute;as que contengan feeds con entradas sin leer/le&iacute;das, respectivamente, facilitando al usuario la tarea de identificaci&oacute;n visual de lo que le queda por leer y, a su vez, libr&aacute;ndolo de <i>clics</i> innecesarios.</p>
  <h3 id="8"><u>&iexcl;Quiero guardar los art&iacute;culos/entradas/posts importantes!</u></h3>
  <p>Puedes hacerlo marcando el checkbox situado al principio del t&iacute;tulo de cada art&iacute;culo/entrada/post.</p>
  <h3 id="9"><u>No puedo crear subcategor&iacute;as</u></h3>
  <p>Como se menciona en el <a href="#2">apartado de las caracter&iacute;sticas de la aplicaci&oacute;n,</a> la categorizaci&oacute;n s&oacute;lo permite un &uacute;nico nivel de categor&iacute;as.</p>
  <h3 id="10"><u>No puedo borrar art&iacute;culos/entradas/posts de los feeds</u></h3>
  <p>Efectivamente no se pueden borrar. En su lugar, se ha decidido que la aplicaci&oacute;n gestione su borrado de forma autom&aacute;tica en funci&oacute;n del n&uacute;mero de art&iacute;culos/entradas/posts configurados. As&iacute; que tranquilo, la aplicaci&oacute;n se encargar&aacute; de realizar esa limpieza por ti.</p>
  <hr>

  <h1>Problemas</h1>
  <h3 id="11"><u>La cancelaci&oacute;n/parada de la actualizaci&oacute;n tarda</u></h3>
  <p>En realidad, esto es inherente a c&oacute;mo funciona la cancelaci&oacute;n/parada de la actualizaci&oacute;n de feeds. Por sencillez, se ha definido un feed entero como operaci&oacute;n at&oacute;mica, fuera de la cual se puede llevar a cabo la parada. As&iacute; pues, durante una actualizaci&oacute;n, cuando se accione la cancelaci&oacute;n/parada, esta ser&aacute; efectiva cuando termine con el &uacute;ltimo feed que se est&eacute; actualizando en ese instante.</p>
  <h3 id="12"><u>La ordenaci&oacute;n por fecha de uno o varios feeds es incorrecta</u></h3>
  <p>&iquest;C&oacute;mo puede ser, si normalmente salen en orden? <i>Por defecto</i> y ya que feedparser no es infalible adivinando todos los formatos de fecha que corren por todos los feeds de Internet, <i>en esta versi&oacute;n (la 0.3) se ha optado por ordenar las entradas de los feeds por orden de llegada</i>. La ordenaci&oacute;n por la columna de fecha puede presentar, pues, el mencionado problema.</p>
  <h3 id="13"><u>Las entradas de uno o varios feeds no muestran el contenido, s&oacute;lo los t&iacute;tulos (o ni eso)</u></h3>
  <p>Del mismo modo que hay feeds que no publican fecha para sus entradas, algunos tampoco proporcionan contenido, sino &uacute;nicamente el t&iacute;tulo (a veces, ni siquiera eso). No te va a quedar otra que visitar su web.</p>
  <h3 id="14"><u>&iexcl;La aplicaci&oacute;n se cerr&oacute; inesperadamente!</u></h3>
  <p>Por desgracia, esto sucede alguna vez y es un error no identificado (abortos, violaciones de segmento, errores de conexi&oacute;n contra las X...). A efectos de ayudar en la labor de identificaci&oacute;n de posibles errores, se ha habilitado un archivo de registro para estos casos (ubicado en <i>/usr/share/naufrago/naufrago.log</i> en el caso del paquete Debian, y en el directorio de descompresi&oacute;n en el caso del tarball). ES BIENVENIDA TODA AYUDA que se quiera aportar en este aspecto.</p>
  <h3 id="15"><u>&iexcl;Quiero reportar/arreglar problemas!</u></h3>
  <p>Si bien la aplicaci&oacute;n ya es m&aacute;s estable, todav&iacute;a presenta problemas. Este punto necesita mayor investigaci&oacute;n y es d&oacute;nde realmente <i>se agradecer&iacute;a ayuda</i> (s&iacute;, tengo <a href="http://es.wikipedia.org/wiki/Sistema_de_control_de_versi&oacute;n">sistema de control de versiones</a> y eres bienvenido; m&aacute;ndame un correo y hablamos). Pod&eacute;is enviar los <a href="http://sourceforge.net/tracker/?group_id=333054&atid=1396393">bugreports al tracker de sourceforge</a> o bien envi&aacute;ndomelos personalmente a mi correo (<b>worbynet@gmail.com</b>).</p>
  <hr>

  <h1>Varios</h1>
  <h3 id="16"><u>Si las entradas RSS son res&uacute;menes, &iquest;son necesarias las im&aacute;genes offline?</u></h3>
  <p>En la pr&aacute;ctica, las entradas RSS no siempre son res&uacute;menes (sino la entrada completa), y no est&aacute; claro hacia d&oacute;nde va a evolucionar este tema en concreto en la Red. Y aunque fuera cierto que las entradas RSS fueran siempre res&uacute;menes, muchos de ellos tambi&eacute;n incluyen im&aacute;genes informativas/complementarias del contenido.</p>
  <h3 id="17"><u>&iquest;Bajo qu&eacute; licencia se distribuye?</u></h3>
  <p>Bajo la GPLv3.</p>
  <h3 id="18"><u>Me gustar&iacute;a que la aplicaci&oacute;n hiciera/tuviera...</u></h3>
  <p>Al igual que los desarrolladores de Liferea, en principio no acepto <i>feature requests</i>, aunque como m&aacute;s se perdi&oacute; en Cuba, no pierdes nada por intentarlo. Si me parece interesante y viable, qui&eacute;n sabe :) Sino, siempre puedes echarme un cable con ello, hacerlo t&uacute; mismo, ped&iacute;rselo a alguien, etc...</p>
  <h3 id="19"><u>Agradecimientos del autor</u></h3>
  <p>El autor agradece a todos aquellos que lo han aguantado durante el desarrollo (especialmente a la parienta :) y a todos los que le han echado un cable (&iexcl;saludos a jcasas y a mito!). Y de igual modo, agradece cualquier colaboraci&oacute;n que se quiera aportar al proyecto, especialmente cazando/resolviendo bugs.</p>
  <h3 id="20"><u>&iquest;Te gusta N&aacute;ufrago!?</u></h3>
  <p>El mejor de los regalos para un escritor de software no es que su aplicaci&oacute;n sea usada, sino que sus usuarios le comuniquen su uso y/o agradecimiento. Un "gracias mochalbete" ser&aacute; suficiente para la mayor&iacute;a de los casos :)</p><p>Aunque tambi&eacute;n puedes colaborar en la mejora del proyecto, en la correcci&oacute;n de <i>bugs</i>, en la implementaci&oacute;n de nuevas caracter&iacute;sticas, en la traducci&oacute;n a nuevos idiomas, en el empaquetado para distintas distros... &iexcl;la lista es interminable! De igual modo, y aunque no resulte tan agradable, tambi&eacute;n puedes realizar cr&iacute;ticas al mismo. En cualquier caso, puedes escribirme a <b>worbynet@gmail.com</b> y estar&eacute; encantado de saber de ti.</p>
 </body>
</html>
