<html>
 <head>
  <title>Preguntes d'&Uacute;s Frequent</title>
 </head>
 <body>
  <center><h1>Preguntes d'&Uacute;s Frequent</h1></center>
  <ol>
   <li><h2>Introducci&oacute;</h2></li>
    <ul>
     <li><a href="#1">Qu&egrave; &eacute;s N&aacute;ufrago!?</a></li>
     <li><a href="#2">Quines caracter&iacute;stiques t&eacute;?</a></li>
     <li><a href="#3">Quins son els requisits m&iacute;nims?</a></li>
     <li><a href="#4">Per qu&egrave; reinventar la roda?</a></li>
     <li><a href="#5"><i>Homesite</i> o canals de distribuci&oacute;</a></li>
    </ul>
   <li><h2>Funcionament</h2></li>
    <ul>
     <li><a href="#6">C&oacute;m funciona el <i>mode offline</i>?</a></li>
     <li><a href="#7">C&oacute;m funciona el <i>mode dirigit</i>?</a></li>
     <li><a href="#8">Vull guardar els articles/entrades/posts importants!</a></li>
     <li><a href="#9">No puc crear subcategor&iacute;es</a></li>
     <li><a href="#10">No puc esborrar articles/entrades/posts dels feeds</a></li>
    </ul>
   <li><h2>Problemes</h2></li>
    <ul>
     <li><a href="#11">La cancel-laci&ograve;/parada de l'actualizaci&ograve; triga</a></li>
     <li><a href="#12">L'endre&ccedil;ar per data un o varios feeds &eacute;s incorrecta</a></li>
     <li><a href="#13">Les entrades d'un o varios feeds no mostren el contingut, nom&egrave;s els t&iacute;tols (o ni aix&ograve;)</a></li>
     <li><a href="#14">L'aplicaci&oacute; es tanca inesperadament!</a></li>
     <li><a href="#15">Vull reportar/arreglar problemes!</a></li>
    </ul>
   <li><h2>Varis</h2></li>
    <ul>
     <li><a href="#16">Si les entrades RSS son resums, son necessaries les imatges offline?</a></li>
     <li><a href="#17">Sota quina llic&egrave;ncia es distribueix?</a></li>
     <li><a href="#18">M'agradaria que l'aplicaci&oacute; fes/tingu&eacute;s...</a></li>
     <li><a href="#19">Agra&iuml;ments de l'autor</a></li>
     <li><a href="#20">T'agrada N&aacute;ufrago!?</a></li>
    </ul>
  </ol>
  <hr>

  <h1>Introducci&oacute;</h1>
  <h3 id="1"><u>Qu&egrave; &eacute;s N&aacute;ufrago!?</u></h3>
  <p>N&aacute;ufrago! és un lector simple de RSS que permet veure noticies amb les seves imatges <i>tot i no manirse surant</i>, o dit d'altre manera, sense estar online. Aix&ograve; &eacute;s perqu&egrave; hi ha persones, com l'autor, que no sempre tenen una conexi&oacute; a m&agrave; i tot i aix&iacute;, vol poder llegir articles/entrades/posts amb les imatges que puguin acompanyar-los. Aquest &eacute;s el <i>leit motiv</i> de l'aplicaci&oacute;.</p>
  <h3 id="2"><u>Quines caracter&iacute;stiques t&eacute;?</u></h3>
  <p>Les destacades ser&iacute;en:
  <ul>
   <li><b>Categorizaci&oacute;</b> de feeds d'un &uacute;nic nivell <b>en arbre</b>.</li>
   <li>Organitzaci&oacute; de feeds per categor&iacute;es mitjan&ccedil;an <b>drag &amp; drop</b>.</li>
   <li><b>Lectura online/offline</b> de feeds (incloent imatges).</li>
   <li><b>Apertura/tancat inteligent de categories</b>.</li>
   <li>Mode <b>pantalla complerta</b> per a la lectura de feeds.</li>
   <li>Marcaci&oacute; de <b>feeds</b> com a <b>importants</b>/<b>permanents</b> (gravaci&oacute;).</li>
   <li>Inclusi&oacute; dels <b>favicons</b> dels feeds.</li>
   <li><b>Iconitzaci&oacute;</b> de l'aplicaci&oacute; <b>a la Tray</b>.</li>
   <li><b>Importaci&oacute;/exportaci&oacute;</b> de feeds en format <b>OPML</b>.</li>
   <li>Carpetes d'<b>importants</b> i <b>no llegits</b>.</li>
   <li><b>Cercador</b> de termes.</li>
   <li><b>Multiidioma</b> (de moment Angl&egrave;s, Franc&egrave;s, Polac, Itali&agrave;, Catal&agrave; i Castell&agrave;).</li>
   <li>Auto<b>comprovador d'actualitzacions</b>.</li>
   </ul></p>
  <h3 id="3"><u>Quins son els requisits m&iacute;nims?</u></h3>
  <p>Si estas llegint aix&ograve;, probablement ja els cumpleixis. A nivell de software:
  <ul>
   <li>Sistema Operatiu GNU/Linux (donat que alguna libreria no est&agrave; per a altres plataformes)</li>
   <li>Python</li>
   <li>python-gtk2 (bindings de gtk)</li>
   <li>python-gobject (bindings de GObject)</li>
   <li>python-pysqlite2 (bindings de sqlite3)</li>
   <li>python-feedparser (bindings de feedparser)</li>
   <li>python-webkit (bindings de webkit)</li>
  </ul>
  A nivell de hardware, qualsevol cosa que pugui moure-ho. L'autor l'ha desenvolupat i l'utilitza a diari des d'un Netbook amb un Intel Atom a 1,6Ghz i 1GB de RAM.</p>
  <h3 id="4"><u>Per qu&egrave; reinventar la roda?</u></h3>
  <p>Si es tracta d'un client <i>clavat</i> (amb excepcions) a Liferea (al menys pel que fa a l'aspecte), perqu&egrave; reinventar la roda? Per molts motius. Principalment perqu&egrave; l'autor no va saber trobar un client RSS que funciones offline amb imatges incloses, els desenvolupadors de Liferea no admeten <i>feature requests</i> (algo totalment respectable) i mirar codi font ali&egrave; requereix doble esfor&ccedil; que crear-ho un mateix (al tanto, opini&oacute; personal!). Reinventant la roda tamb&eacute; s'apren, i a m&eacute;s poden sorgir millores o noves maneres de fer les coses que d'altre mode no hagu&egrave;ssin sorgit.</p>
  <h3 id="5"><u><i>Homesite</i> o canals de distribuci&oacute;</u></h3>
  <p>El projecte pot trobar-se tant <a href="http://enchufado.com/">al blog de l'autor</a> com a <a href="http://sourceforge.net/projects/naufrago">la plana web del projecte a sourceforge</a>.</p>
  <hr>

  <h1>Funcionamient</h1>
  <h3 id="6"><u>C&oacute;m funciona el <i>mode offline</i>?</u></h3>
  <p>Aquest mode s'asegura que es tingui acc&egrave;s als articles/entrades/posts amb les seves imatges sense conexi&oacute; a Internet, sense interferir en cap altre aspecte en el funcionamient de l'aplicaci&oacute;. Aix&ograve; significa que pots deixar-ho activat sempre, tant amb conexi&oacute; a Internet com sense, i l'aplicaci&oacute; seguir&agrave; obtenient els articles/entrades/posts nous (cas d'haver conexi&oacute;). L'&uacute;nic inconvenient &eacute;s que consumir&aacute; m&eacute;s ample de banda i trigar&agrave;  m&eacute;s a obtenir les actualizacions, donat que tamb&eacute; baixar&aacute; les imatges. <b>ATENCI&Oacute;: </b>Per a que el mode offline funcioni correctament, despr&eacute;s d'activarlo al di&agrave;leg de prefer&egrave;ncies, deus actualitzar tots els feeds dels quals vulguis veure les seves imatges sense conexi&oacute;.</p>
  <h3 id="7"><u>C&oacute;m funciona el <i>mode dirigit</i>?</u></h3>
  <p>Aquest mode act&uacute;a desplegant/plegant les categor&iacute;es que continguin feeds amb entrades sense llegir/llegides, respectivament, facilitant a l'usuari la tasca d'identificaci&oacute; visual del que li queda per llegir i, alhora, lliurant-lo de <i>clics</i> innecesaris.</p>
  <h3 id="8"><u>Vull guardar els articles/entrades/posts importants!</u></h3>
  <p>Pots fer-ho marcant el checkbox situat al principi del t&iacute;tol de cada article/entrada/post.</p>
  <h3 id="9"><u>No puc crear subcategor&iacute;es</u></h3>
  <p>Com s'esmenta a <a href="#2">l'apartat de les caracter&iacute;stiques de l'aplicaci&oacute;,</a> la categorizaci&oacute; nom&egrave;s permit un &uacute;nic nivell de categor&iacute;es.</p>
  <h3 id="10"><u>No puc esborrar articles/entrades/posts dels feeds</u></h3>
  <p>Efectivament no es poden esborrar. En lloc d'aix&ograve;, s'ha decidit que l'aplicaci&oacute; gestioni el seu esborrat de forma autom&agrave;tica en funci&oacute; del nombre d'articles/entrades/posts configurades. Aix&iacute; que tranquil, l'aplicaci&oacute; s'encarregar&aacute; de realitzar aquesta neteja per tu.</p>
  <hr>

  <h1>Problemes</h1>
  <h3 id="11"><u>La cancel-laci&ograve;/parada de l'actualizaci&ograve; triga</u></h3>
  <p>En realitat, aix&ograve; &eacute;s inherent a c&oagrave;m funciona la cancel-laci&oacute;/parada de l'actualizaci&oacute; de feeds. Per sensillesa, s'ha definit un feed sencer com a operaci&oacute; at&oagrave;mica, fora de la qual es pot dur a terme la parada. Aix&iacute; doncs, durant una actualizaci&oacute;, quan s'accioni la cancel-laci&oacute;/parada, aquesta ser&aacute; efectiva quan acabi amb el darrer feed que s'estigui actualizant en aquell instant.</p>
  <h3 id="12"><u>L'endre&ccedil;ar per data un o varios feeds &eacute;s incorrecta</u></h3>
  <p>C&oacute;m pot ser, si normalment surten endre&ccedil;ats? <i>Per defecte</i> i donat que feedparser no &eacute;s infalible adivinant tots els formats de data que corren per tots els feeds d'Internet, <i>en aquesta versi&oacute; (la 0.3) s'ha optat per endre&ccedil;ar les entrades dels feeds per ordre d'arribada</i>. L'endre&ccedil;ament per la columna de data pot presentar, doncs, l'esmentat problema.</p>
  <h3 id="13"><u>Les entrades d'un o varis feeds no mostren el contingut, nom&egrave;s els t&iacute;tols (o ni aix&ograve;)</u></h3>
  <p>Del mateix mode que hi ha feeds que no publiquen data per a les seves entrades, alguns tampoc proporcionen contingut, sino &uacute;nicament t&iacute;tol (a vegades, ni tant sols aix&ograve;). No et quedar&agrave; altre que visitar la seva web.</p>
  <h3 id="14"><u>L'aplicaci&oacute; es tanca inesperadament!</u></h3>
  <p>Per desgracia, aix&ograve; passa algun cop i &eacute;s un error no identificat (abortaments, violacions de segment, errors de conexió contra les X...). A efectes d'ajudar  en la tasca d'identificaci&oacute; de possibles errors, s'ha habilitat un arxiu de registre per a aquests casos (ubicat a <i>/usr/share/naufrago/naufrago.log</i> en el cas del paquet Debian, i en el directori de descompresi&oacute; en el cas del tarball). ES BENVINGUDA TOTA AJUDA que es vulgui aportar en aquest aspecte.</p>
  <h3 id="15"><u>Vull reportar/arreglar problemes!</u></h3>
  <p>Si be l'aplicaci&oacute; ja &eacute;s m&eacute;s estable, encara presenta problemes. Aquest punt necessita major investigaci&oacute; i &eacute;s on realment s'agra&iuml;r&iacute;a ajuda (s&iacute;, disposo de sistema de control de versions i ets benvingut; envia'm un correo i en parlem). Podeu enviar bugreports al tracker de sourceforge o be enviant-los al meu correo personal (worbynet@gmail.com).</p>
  <hr>

  <h1>Varios</h1>
  <h3 id="16"><u>Si les entrades RSS son resums, son necessaries les imatges offline?</u></h3>
  <p>A la pr&agrave;ctica, les entrades RSS no sempre son resums (sino l'entrada complerta), i no est&agrave; clar cap a &oacute;n evolucionar&agrave; aquest tema en concret a la Xarxa. I tot i que fos cert que les entrades RSS foren sempre resums, molts d'ells tamb&eacute; inclouen imatges informatives/complementaries del contingut.</p>
  <h3 id="17"><u>Sota quina llic&egrave;ncia es distribueix?</u></h3>
  <p>Sota la GPLv3.</p>
  <h3 id="18"><u>M'agradaria que l'aplicaci&oacute; fes/tingu&eacute;s...</u></h3>
  <p>De la mateixa manera que els desenvolupadors de Liferea, en principi no accepto <i>feature requests</i>, tot i que com m&eacute;s es va perdre a Cuba, no perds res per a intentar-ho. Si em sembla interessant i viable, qui sap :) Sino, sempre pots donar-me un cop de m&agrave; amb el tema, fer-ho t&uacute; mateix, demanar-ho a alg&uacute; altre, etc...</p>
  <h3 id="19"><u>Agra&iuml;ments de l'autor</u></h3>
  <p>L'autor agraeix a tots aquells que l'han aguantat durant el desenvolupament (especialment a la parenta :) i a tots els que l'han donat un cop de m&agrave;. Aix&iacute; mateix, agraeix qualsevol col-laboraci&oacute; que es vulgui aportar al projecte.</p>
  <h3 id="20"><u>T'agrada N&aacute;ufrago!?</u></h3>
  <p>El millor dels regals per a un escritor de software no &eacute;s que la seva aplicaci&oacute; sigui utilitzada, sino que els seus usuaris li comuniquin el seu &uacute;s i/o agraïment. Un "gracies nanu" ser&agrave; suficient per a la major&iacute;a dels casos :)</p><p>Tot i que tamb&eacute; pots col-laborar en la millora del projecte, en la correcci&oacute; de <i>bugs</i>, en l'implementaci&oacute; de noves caracter&iacute;stiques, en la traducci&oacute; a nous idiomes, en l'empaquetat per a diferents distros... la llista no t&eacute; fi! Del mateix mode, i tot i que no resulti tant agradable, tamb&eacute; pots realitzar cr&iacute;tiques al mateix. En qualsevol cas, pots escriureli a <b>worbynet@gmail.com</b> i estar&agrave; encantat de saber de tu.</p>
 </body>
</html>
