Repository: jors/naufrago
Catalog: naufrago/locale/*/*.po
Languages: de, fr

source: Are you sure you want to <b>mark it ALL as READ</b>?
de: Wirklich <b>ALLES als GELESEN</b> markieren?
fr: Êtes vous sûr de vouloir <b>TOUT marquer comme LU</b> ?

source: Unread
de: Ungelesen
fr: Non Lus

source: Important
de: Wichtig

source: Category
de: Kategorie
fr: Catégorie

source: Special folder
de: Besonderer Ordner
fr: Répertoire spécial

source: Source
de: Quelle

source: Warning!
de: Warnung!
fr: Avertissement !

source: Upgrade checker
de: Nach Erweiterungen suchen
fr: Vérifier les mises-à-jour

source: Close
de: Schließen
fr: Fermer

source: No updates available.
de: Keine updates verfügbar.
fr: Aucune mise-à-jour disponible.

source: is available! Get it at:
de: ist verfügbar! Hier runterzuladen:

source: Coult not contact server. Try again later!
de: Konnte Server nicht erreichen. Versuche es zu einem späteren Zeitpunkt nochmal!
fr: Impossible d'établir le contact avec le serveur. Réessayez plus tard !

source: Naufrago! is a simple RSS reader
de: Naufrago! ist ein schlanker RSS Reader
fr: Naufrago! est un lecteur simplifié de flux RSS

source: _Archive
de: _Archiv
fr: _Archiver

source: _New feed
de: _Neuer Feed
fr: _Nouveau flux

source: Adds a feed
de: Fügt einen Feed hinzu
fr: Ajouter un flux

source: New _category
de: Neue Kategorie
fr: Nouvelle _catégorie

source: Adds a category
de: Fügt eine Kategorie hinzu
fr: Ajouter une catégorie

source: Delete feed
de: Feed löschen
fr: Supprimer le flux

source: Deletes a feed
de: Löscht einen Feed
fr: Supprime un flux

source: Delete category
de: Kategorie löschen
fr: Supprimer la catégorie

source: Deletes a category
de: Löscht eine Kategorie
fr: Supprime une catégorie

source: Import feeds
de: Feeds importieren
fr: Importer des flux

source: Imports a feedlist
de: Importiert eine Feedliste
fr: Importe une liste de flux

source: Export feeds
de: Feeds exportieren
fr: Exporter les flux

source: Exports a feedlist
de: Exportiert eine Feedliste
fr: Exporte une liste de flux

source: _Quit
de: Beenden
fr: _Quitter

source: Quits
de: Beendet Naufrago!
fr: Quitte

source: _Edit
de: B_earbeiten
fr: _Editer

source: Edits the selected element
de: Bearbeitet das ausgewählte Element
fr: Édite l'élément sélectionné

source: Search
de: Suchen
fr: Rechercher

source: Searchs for a term in the feeds
de: Sucht nach einem Ausdruck in den Feeds
fr: Recherche un terme dans les flux

source: Read all
de: Alle gelesen
fr: Tout lire

source: Mark all feed items as read
de: Alle Feeds als gelesen markieren
fr: Marquer tous les flux comme lus

source: _Preferences
de: Einstellungen
fr: _Préférences

source: Shows preferences
de: Zeigt die Einstellungen
fr: Affiche les préférences

source: _Network
de: _Netzwerk
fr: Réseau

source: _Update
de: Akt_ualisieren
fr: Act_ualiser

source: Updates the selected feed
de: Aktualisiert den gewählten Feed
fr: Actualise le flux sélectionné

source: Update all
de: Alle aktualisieren
fr: Tout actualiser

source: Update all feeds
de: Aktualisiert alle Feeds
fr: Actualise tous les flux

source: Stop update
de: Aktualisierung anhalten
fr: Interrompre l'actualisation

source: _Help
de: _Hilfe
fr: Aide

source: Check updates
de: Auf neue Version prüfen
fr: Vérifier les mises-à-jour

source: _About
de: Über
fr: _A propos

source: About
de: Über
fr: À propos

source: Date
de: Datum

source: Title
de: Titel
fr: Titre

source: Clic to fullscreen
de: Klicken für Vollbildschirm
fr: Afficher en plein-écran

source: Click to open in browser
de: Klicken um in Browser zu öffnen

source: Quit
de: Beenden
fr: Quitter

source: Today
de: Heute
fr: Aujourd'hui

source: Edit category
de: Kategorie bearbeiten
fr: Éditer la catégorie

source: Change <b>category</b> name to:
de: Name der <b>Kategorie</b> ändern zu:
fr: Remplacer le nom de la <b>catégorie</b> par:

source: Edit
de: Bearbeiten
fr: Éditer

source: Add category
de: Kategorie hinzufügen
fr: Ajouter une catégorie

source: Please, insert the <b>category</b>:
de: Bitte <b>Kategorie</b> einfügen:
fr: Veuillez entrer le nom de la nouvelle <b>catégorie</b>:

source: Create
de: Erstellen
fr: Créer

source: Category <b>already present</b>!
de: Kategorie <b>existiert bereits</b>!
fr: Catégorie <b>déjà existante</b> !

source: Delete the selected <b>category</b>?
de: Lösche die gewählte <b>Kategorie</b>?
fr: Supprimer la <b>catégorie</b> sélectionnée ?

source: <b>Atention:</b> all contained RSS will be also deleted. Proceed?
de: <b>Achtung:</b> Alle beinhalteten Einträge werden gelöscht. Fortführen?
fr: <b>Attention:</b> tout le contenu RSS sera également supprimé. Procéder quand même ?

source: This category <b>cannot be deleted</b>!
de: Diese Kategorie <b>kann nicht gelöscht werden</b>!
fr: Cette catégorie <b>ne peut pas être supprimée</b> !

source: You <b>must choose a category</b> folder!
de: <b>Wähle eine Kategorie</b>
fr: Vous <b>devez choisir un répertoire de catégorie</b> !

source: Edit feed
de: Bearbeite Feed
fr: Éditer le flux

source: Change <b>feed</b> data:
de: Ändere die <b>Feed</b> Daten:
fr: Changer les données du <b>flux</b>:

source: Add feed
de: Feed hinzufügen
fr: Ajouter un flux

source: Please, insert <b>feed</b> address:
de: Bitte <b>Feed</b> Adresse eingeben:
fr: Veuillez insérer l'adresse du <b>flux</b>:

source: Add
de: Hinzufügen
fr: Ajouter

source: Default name
de: Standard Name
fr: Nom par défaut

source: Feed <b>already present</b>!
de: Feed <b>existiert bereits</b>!
fr: Flux <b>déjà existant</b> !

source: Delete selected <b>feed</b>?
de: Lösche gewählten <b>Feed</b>?
fr: Supprimer le <b>flux</b> sélectionné ?

source: You <b>must choose a feed</b>!
de: <b>Wähle einen Feed</b>!
fr: Vous <b>devez choisir un flux</b> !

source: This category <b>cannot be edited</b>!
de: Diese Kategorie <b>kann nicht bearbeitet werden</b>!
fr: Cette catégorie <b>ne peut pas être éditer</b> !

source: You <b>must choose a category or a feed</b> to edit!
de: <b>Wähle eine Kategorie oder einen Feed</b> zum bearbeiten!
fr: Vous <b>devez choisir une catégorie ou un flux</b> à éditer !

source: Insert the <b>searchterm</b>:
de: Füge den <b>Suchbegriff</b> ein:
fr: Insérez le <b>terme à rechercher</b>:

source: Search results for
de: Suchergebnisse für
fr: Résultats de la recherche pour:

source: No entry found for <b>
de: Kein Eintrag gefunden für <b>
fr: Aucun résultat pour <b>

source: Applying changes...
de: Änderung anwenden...
fr: Appliquer les changements...

source: Preferences
de: Einstellungen
fr: Préférences

source: Save
de: Speichern
fr: Enregistrer

source: Start with unfolded tree
de: Mit eingeklappten Ordnern starten
fr: Démarrer avec l'arborescence dépliée

source: Driven mode
de: Angetriebenen modus
fr: Affichage amélioré

source: Clear mode
de: Klar modus
fr: Mode nettoyage

source: Start in Tray Icon
de: Im Benachrichtigungssymbol starten
fr: Démarrer dans la Zone de Notification

source: Update on start
de: Beim Start aktualisieren
fr: Actualiser au démarrage

source: Check application updates on start
de: Beim Start nach verfügbaren Updates suchen
fr: Vérifier les mises-à-jour au démarrage

source: Number of feed entries
de: Anzahl an Feed Einträgen
fr: Nombre d'articles par flux

source: Update every
de: Aktualisierung alle
fr: Actualiser toutes les

source: hour/s
de: Stunde/n
fr: heure(s)

source: minute/s
de: Minute/n
fr: minutes(s)

source: Hide read entries
de: Gelesene Einträge verstecken
fr: Cacher les articles lus

source: Feeds & articles
de: Feeds & Artikel
fr: Flux et articles

source: Hide dates
de: Datum verstecken
fr: Cacher les dates

source: Notification on new entries
de: Bei neuen Einträgen benachrichtigen
fr: Notifier les nouveaux articles

source: Show icon in tray
de: Benachrichtigungssymbol anzeigen
fr: Afficher l'icône de démarrage rapide

source: Toolbar mode
de: Modus der Werkzeugleiste
fr: Barre d'outils

source: Full
de: Komplett
fr: Affichage Complet

source: Icons only
de: Nur Icons
fr: Icônes seules

source: Text only
de: Nur Text
fr: Texte seul

source: Hidden
de: Versteckt
fr: Barre Cachée

source: Interface
de: Schnittstelle

source: Offline mode (slow)
de: Offline Modus (langsam)
fr: Mode Hors-Ligne (lent!)

source: Deep offline mode (slower!)
de: Tiefer Offline Modus (langsamer!)
fr: Mode Hors-Ligne Profond (plus lent!)

source: Modes
de: Modi

source: Use Proxy
de: Proxy benutzen

source: Mark all as read
de: Alle als gelesen markieren
fr: Marquer comme Tous Lus

source: Update
de: Aktualisieren
fr: Actualiser

source: Delete
de: Löschen
fr: Supprimer

source: New feed
de: Neuer Feed
fr: Nouveau flux

source: New category
de: Neue Kategorie
fr: Nouvelle catégorie

source: Open in browser
de: In Browser öffnen
fr: Ouvrir dans le navigateur

source: Copy URL to clipboard
de: URL in die Zwischenablage kopieren
fr: Copier l'URL dans le presse-papiers

source: Toggle read/non-read
de: Lesestatus ändern
fr: (Dés)Activer Lu/Non Lu

source: Toggle all read/non-read
de: Lesestatus von allen Einträgen ändern
fr: (Dés)Activer Tous Lus/Non Lus

source: Without title
de: Ohne Titel
fr: Sans titre

source: Without link
de: Ohne Link
fr: Sans lien

source: Obtaining image
de: Lade Bild
fr: Importation de l'image

source: Obtaining offline content
de: Lade Offline Inhalt
fr: Récupération du contenu hors-ligne

source: Obtaining offline content from
de: Lade Offline Inhalt von
fr: Récupération du contenu hors-ligne à partir de

source: Doing cleanup
de: Räume auf
fr: Faire un nettoyage

source: Obtaining feed
de: Lade Feed
fr: Importation du flux

source: New entry/s
de: Neue Einträge
fr: Nouvelle(s) catégorie(s)

source: entry/s were added
de: Einträge wurden hinzugefügt
fr: catégorie(s) ajoutée(s)

source: Open..
de: Öffnen..
fr: Ouvrir..

source: All files
de: Alle Dateien
fr: Tous les fichiers

source: _Save
de: _Speichern
fr: Enregi_strer

source: Error importing modules:
fr: Importation des modules impossible:

source: Feed
fr: Flux

source: E_dit
fr: É_diter

source: Stop
fr: Interrompre

source: Feeds
fr: Flux

source: Clic to open in browser
fr: Ouvrir dans le navigateur

source: Name
fr: Nom

source: Start
fr: Démarrage
